zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/pdca.h
/**
 * \file
 *
 * \brief Component description for PDCA
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_PDCA_COMPONENT_
#define _SAM4L_PDCA_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PDCA */
/* ========================================================================== */
/** \addtogroup SAM4L_PDCA Peripheral DMA Controller */
/*@{*/

#define PDCA_I7514
#define REV_PDCA                    0x124

/* -------- PDCA_MAR : (PDCA Offset: 0x000) (R/W 32) channel Memory Address Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MADDR:32;         /*!< bit:  0..31  Memory Address                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_MAR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_MAR_OFFSET             0x000        /**< \brief (PDCA_MAR offset) Memory Address Register */
#define PDCA_MAR_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_MAR reset_value) Memory Address Register */

#define PDCA_MAR_MADDR_Pos          0            /**< \brief (PDCA_MAR) Memory Address */
#define PDCA_MAR_MADDR_Msk          (_U_(0xFFFFFFFF) << PDCA_MAR_MADDR_Pos)
#define PDCA_MAR_MADDR(value)       (PDCA_MAR_MADDR_Msk & ((value) << PDCA_MAR_MADDR_Pos))
#define PDCA_MAR_MASK               _U_(0xFFFFFFFF) /**< \brief (PDCA_MAR) MASK Register */

/* -------- PDCA_PSR : (PDCA Offset: 0x004) (R/W 32) channel Peripheral Select Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PID:8;            /*!< bit:  0.. 7  Peripheral Identifier              */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_PSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_PSR_OFFSET             0x004        /**< \brief (PDCA_PSR offset) Peripheral Select Register */

#define PDCA_PSR_PID_Pos            0            /**< \brief (PDCA_PSR) Peripheral Identifier */
#define PDCA_PSR_PID_Msk            (_U_(0xFF) << PDCA_PSR_PID_Pos)
#define PDCA_PSR_PID(value)         (PDCA_PSR_PID_Msk & ((value) << PDCA_PSR_PID_Pos))
#define PDCA_PSR_MASK               _U_(0x000000FF) /**< \brief (PDCA_PSR) MASK Register */

/* -------- PDCA_TCR : (PDCA Offset: 0x008) (R/W 32) channel Transfer Counter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TCV:16;           /*!< bit:  0..15  Transfer Counter Value             */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_TCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_TCR_OFFSET             0x008        /**< \brief (PDCA_TCR offset) Transfer Counter Register */
#define PDCA_TCR_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_TCR reset_value) Transfer Counter Register */

#define PDCA_TCR_TCV_Pos            0            /**< \brief (PDCA_TCR) Transfer Counter Value */
#define PDCA_TCR_TCV_Msk            (_U_(0xFFFF) << PDCA_TCR_TCV_Pos)
#define PDCA_TCR_TCV(value)         (PDCA_TCR_TCV_Msk & ((value) << PDCA_TCR_TCV_Pos))
#define PDCA_TCR_MASK               _U_(0x0000FFFF) /**< \brief (PDCA_TCR) MASK Register */

/* -------- PDCA_MARR : (PDCA Offset: 0x00C) (R/W 32) channel Memory Address Reload Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MARV:32;          /*!< bit:  0..31  Memory Address Reload Value        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_MARR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_MARR_OFFSET            0x00C        /**< \brief (PDCA_MARR offset) Memory Address Reload Register */
#define PDCA_MARR_RESETVALUE        _U_(0x00000000); /**< \brief (PDCA_MARR reset_value) Memory Address Reload Register */

#define PDCA_MARR_MARV_Pos          0            /**< \brief (PDCA_MARR) Memory Address Reload Value */
#define PDCA_MARR_MARV_Msk          (_U_(0xFFFFFFFF) << PDCA_MARR_MARV_Pos)
#define PDCA_MARR_MARV(value)       (PDCA_MARR_MARV_Msk & ((value) << PDCA_MARR_MARV_Pos))
#define PDCA_MARR_MASK              _U_(0xFFFFFFFF) /**< \brief (PDCA_MARR) MASK Register */

/* -------- PDCA_TCRR : (PDCA Offset: 0x010) (R/W 32) channel Transfer Counter Reload Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TCRV:16;          /*!< bit:  0..15  Transfer Counter Reload Value      */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_TCRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

