zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/pdca.h
#define PDCA_TCRR_OFFSET            0x010        /**< \brief (PDCA_TCRR offset) Transfer Counter Reload Register */
#define PDCA_TCRR_RESETVALUE        _U_(0x00000000); /**< \brief (PDCA_TCRR reset_value) Transfer Counter Reload Register */

#define PDCA_TCRR_TCRV_Pos          0            /**< \brief (PDCA_TCRR) Transfer Counter Reload Value */
#define PDCA_TCRR_TCRV_Msk          (_U_(0xFFFF) << PDCA_TCRR_TCRV_Pos)
#define PDCA_TCRR_TCRV(value)       (PDCA_TCRR_TCRV_Msk & ((value) << PDCA_TCRR_TCRV_Pos))
#define PDCA_TCRR_MASK              _U_(0x0000FFFF) /**< \brief (PDCA_TCRR) MASK Register */

/* -------- PDCA_CR : (PDCA Offset: 0x014) ( /W 32) channel Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TEN:1;            /*!< bit:      0  Transfer Enable                    */
    uint32_t TDIS:1;           /*!< bit:      1  Transfer Disable                   */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t ECLR:1;           /*!< bit:      8  Error Clear                        */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_CR_OFFSET              0x014        /**< \brief (PDCA_CR offset) Control Register */
#define PDCA_CR_RESETVALUE          _U_(0x00000000); /**< \brief (PDCA_CR reset_value) Control Register */

#define PDCA_CR_TEN_Pos             0            /**< \brief (PDCA_CR) Transfer Enable */
#define PDCA_CR_TEN                 (_U_(0x1) << PDCA_CR_TEN_Pos)
#define PDCA_CR_TDIS_Pos            1            /**< \brief (PDCA_CR) Transfer Disable */
#define PDCA_CR_TDIS                (_U_(0x1) << PDCA_CR_TDIS_Pos)
#define PDCA_CR_ECLR_Pos            8            /**< \brief (PDCA_CR) Error Clear */
#define PDCA_CR_ECLR                (_U_(0x1) << PDCA_CR_ECLR_Pos)
#define PDCA_CR_MASK                _U_(0x00000103) /**< \brief (PDCA_CR) MASK Register */

/* -------- PDCA_MR : (PDCA Offset: 0x018) (R/W 32) channel Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SIZE:2;           /*!< bit:  0.. 1  Transfer size                      */
    uint32_t ETRIG:1;          /*!< bit:      2  Event trigger                      */
    uint32_t RING:1;           /*!< bit:      3  Ring Buffer                        */
    uint32_t :28;              /*!< bit:  4..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_MR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_MR_OFFSET              0x018        /**< \brief (PDCA_MR offset) Mode Register */
#define PDCA_MR_RESETVALUE          _U_(0x00000000); /**< \brief (PDCA_MR reset_value) Mode Register */

#define PDCA_MR_SIZE_Pos            0            /**< \brief (PDCA_MR) Transfer size */
#define PDCA_MR_SIZE_Msk            (_U_(0x3) << PDCA_MR_SIZE_Pos)
#define PDCA_MR_SIZE(value)         (PDCA_MR_SIZE_Msk & ((value) << PDCA_MR_SIZE_Pos))
#define   PDCA_MR_SIZE_BYTE_Val           _U_(0x0)   /**< \brief (PDCA_MR)  */
#define   PDCA_MR_SIZE_HALF_WORD_Val      _U_(0x1)   /**< \brief (PDCA_MR)  */
#define   PDCA_MR_SIZE_WORD_Val           _U_(0x2)   /**< \brief (PDCA_MR)  */
#define PDCA_MR_SIZE_BYTE           (PDCA_MR_SIZE_BYTE_Val         << PDCA_MR_SIZE_Pos)
#define PDCA_MR_SIZE_HALF_WORD      (PDCA_MR_SIZE_HALF_WORD_Val    << PDCA_MR_SIZE_Pos)
#define PDCA_MR_SIZE_WORD           (PDCA_MR_SIZE_WORD_Val         << PDCA_MR_SIZE_Pos)
#define PDCA_MR_ETRIG_Pos           2            /**< \brief (PDCA_MR) Event trigger */
#define PDCA_MR_ETRIG               (_U_(0x1) << PDCA_MR_ETRIG_Pos)
#define PDCA_MR_RING_Pos            3            /**< \brief (PDCA_MR) Ring Buffer */
#define PDCA_MR_RING                (_U_(0x1) << PDCA_MR_RING_Pos)
#define PDCA_MR_MASK                _U_(0x0000000F) /**< \brief (PDCA_MR) MASK Register */

/* -------- PDCA_SR : (PDCA Offset: 0x01C) (R/  32) channel Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TEN:1;            /*!< bit:      0  Transfer Enabled                   */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_SR_OFFSET              0x01C        /**< \brief (PDCA_SR offset) Status Register */
#define PDCA_SR_RESETVALUE          _U_(0x00000000); /**< \brief (PDCA_SR reset_value) Status Register */

#define PDCA_SR_TEN_Pos             0            /**< \brief (PDCA_SR) Transfer Enabled */
#define PDCA_SR_TEN                 (_U_(0x1) << PDCA_SR_TEN_Pos)
#define PDCA_SR_MASK                _U_(0x00000001) /**< \brief (PDCA_SR) MASK Register */

/* -------- PDCA_IER : (PDCA Offset: 0x020) ( /W 32) channel Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RCZ:1;            /*!< bit:      0  Reload Counter Zero                */
    uint32_t TRC:1;            /*!< bit:      1  Transfer Complete                  */
    uint32_t TERR:1;           /*!< bit:      2  Transfer Error                     */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

