zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/pdca.h
#define PDCA_IER_OFFSET             0x020        /**< \brief (PDCA_IER offset) Interrupt Enable Register */
#define PDCA_IER_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_IER reset_value) Interrupt Enable Register */

#define PDCA_IER_RCZ_Pos            0            /**< \brief (PDCA_IER) Reload Counter Zero */
#define PDCA_IER_RCZ                (_U_(0x1) << PDCA_IER_RCZ_Pos)
#define PDCA_IER_TRC_Pos            1            /**< \brief (PDCA_IER) Transfer Complete */
#define PDCA_IER_TRC                (_U_(0x1) << PDCA_IER_TRC_Pos)
#define PDCA_IER_TERR_Pos           2            /**< \brief (PDCA_IER) Transfer Error */
#define PDCA_IER_TERR               (_U_(0x1) << PDCA_IER_TERR_Pos)
#define PDCA_IER_MASK               _U_(0x00000007) /**< \brief (PDCA_IER) MASK Register */

/* -------- PDCA_IDR : (PDCA Offset: 0x024) ( /W 32) channel Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RCZ:1;            /*!< bit:      0  Reload Counter Zero                */
    uint32_t TRC:1;            /*!< bit:      1  Transfer Complete                  */
    uint32_t TERR:1;           /*!< bit:      2  Transfer Error                     */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_IDR_OFFSET             0x024        /**< \brief (PDCA_IDR offset) Interrupt Disable Register */
#define PDCA_IDR_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_IDR reset_value) Interrupt Disable Register */

#define PDCA_IDR_RCZ_Pos            0            /**< \brief (PDCA_IDR) Reload Counter Zero */
#define PDCA_IDR_RCZ                (_U_(0x1) << PDCA_IDR_RCZ_Pos)
#define PDCA_IDR_TRC_Pos            1            /**< \brief (PDCA_IDR) Transfer Complete */
#define PDCA_IDR_TRC                (_U_(0x1) << PDCA_IDR_TRC_Pos)
#define PDCA_IDR_TERR_Pos           2            /**< \brief (PDCA_IDR) Transfer Error */
#define PDCA_IDR_TERR               (_U_(0x1) << PDCA_IDR_TERR_Pos)
#define PDCA_IDR_MASK               _U_(0x00000007) /**< \brief (PDCA_IDR) MASK Register */

/* -------- PDCA_IMR : (PDCA Offset: 0x028) (R/  32) channel Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RCZ:1;            /*!< bit:      0  Reload Counter Zero                */
    uint32_t TRC:1;            /*!< bit:      1  Transfer Complete                  */
    uint32_t TERR:1;           /*!< bit:      2  Transfer Error                     */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_IMR_OFFSET             0x028        /**< \brief (PDCA_IMR offset) Interrupt Mask Register */
#define PDCA_IMR_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_IMR reset_value) Interrupt Mask Register */

#define PDCA_IMR_RCZ_Pos            0            /**< \brief (PDCA_IMR) Reload Counter Zero */
#define PDCA_IMR_RCZ                (_U_(0x1) << PDCA_IMR_RCZ_Pos)
#define PDCA_IMR_TRC_Pos            1            /**< \brief (PDCA_IMR) Transfer Complete */
#define PDCA_IMR_TRC                (_U_(0x1) << PDCA_IMR_TRC_Pos)
#define PDCA_IMR_TERR_Pos           2            /**< \brief (PDCA_IMR) Transfer Error */
#define PDCA_IMR_TERR               (_U_(0x1) << PDCA_IMR_TERR_Pos)
#define PDCA_IMR_MASK               _U_(0x00000007) /**< \brief (PDCA_IMR) MASK Register */

/* -------- PDCA_ISR : (PDCA Offset: 0x02C) (R/  32) channel Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RCZ:1;            /*!< bit:      0  Reload Counter Zero                */
    uint32_t TRC:1;            /*!< bit:      1  Transfer Complete                  */
    uint32_t TERR:1;           /*!< bit:      2  Transfer Error                     */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_ISR_OFFSET             0x02C        /**< \brief (PDCA_ISR offset) Interrupt Status Register */
#define PDCA_ISR_RESETVALUE         _U_(0x00000000); /**< \brief (PDCA_ISR reset_value) Interrupt Status Register */

#define PDCA_ISR_RCZ_Pos            0            /**< \brief (PDCA_ISR) Reload Counter Zero */
#define PDCA_ISR_RCZ                (_U_(0x1) << PDCA_ISR_RCZ_Pos)
#define PDCA_ISR_TRC_Pos            1            /**< \brief (PDCA_ISR) Transfer Complete */
#define PDCA_ISR_TRC                (_U_(0x1) << PDCA_ISR_TRC_Pos)
#define PDCA_ISR_TERR_Pos           2            /**< \brief (PDCA_ISR) Transfer Error */
#define PDCA_ISR_TERR               (_U_(0x1) << PDCA_ISR_TERR_Pos)
#define PDCA_ISR_MASK               _U_(0x00000007) /**< \brief (PDCA_ISR) MASK Register */

/* -------- PDCA_PCONTROL : (PDCA Offset: 0x800) (R/W 32) Performance Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CH0EN:1;          /*!< bit:      0  Channel 0 Enabled                  */
    uint32_t CH1EN:1;          /*!< bit:      1  Channel 1 Enabled.                 */
    uint32_t :2;               /*!< bit:  2.. 3  Reserved                           */
    uint32_t CH0OF:1;          /*!< bit:      4  Channel 0 Overflow Freeze          */
    uint32_t CH1OF:1;          /*!< bit:      5  Channel 1 overflow freeze          */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t CH0RES:1;         /*!< bit:      8  Channel 0 counter reset            */
    uint32_t CH1RES:1;         /*!< bit:      9  Channel 1 counter reset            */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t MON0CH:6;         /*!< bit: 16..21  PDCA Channel to monitor with counter 0 */
    uint32_t :2;               /*!< bit: 22..23  Reserved                           */
    uint32_t MON1CH:6;         /*!< bit: 24..29  PDCA Channel to monitor with counter 1 */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PDCA_PCONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDCA_PCONTROL_OFFSET        0x800        /**< \brief (PDCA_PCONTROL offset) Performance Control Register */
#define PDCA_PCONTROL_RESETVALUE    _U_(0x00000000); /**< \brief (PDCA_PCONTROL reset_value) Performance Control Register */

